# Errors
ntf-error-unknown-state = <i>⚠️ Произошла ошибка. Диалог перезапущен</i>
ntf-error-unknown-intent = <i>⚠️ Произошла ошибка. Диалог перезапущен</i>
ntf-error-connect-remnawave = <i>⚠️ Ошибка: Не удалось подключиться к Remnawave</i>
ntf-error-log-not-found = <i>⚠️ Ошибка: Лог файл не найден</i>

# Events
ntf-event-error =
    #EventError
    
    <b>🔅 Событие: Произошла ошибка!</b>

    { $user -> 
        [1]
        Пользователь: { $id } ({ $name })
        Ошибка: { $error }
        *[0] 
        Ошибка: { $error }
    }
    

ntf-event-bot-startup =
    #EventBotStarted

    <b>🔅 Событие: Бот запущен!</b>

    Режим обслуживания: { $mode ->
        [global] включен (глобальный)
        [purchase] включен (платежи)
        *[off] выключен
    }

ntf-event-bot-shutdown =
    #EventBotShutdown

    <b>🔅 Событие: Бот остановлен!</b>

ntf-event-new-user =
    #EventNewUser

    <b>🔅 Событие: Новый пользователь!</b>

    <blockquote>
    • ID: {$id}
    • Имя: {$name}
    </blockquote>

# Notifications

ntf-throttling-many-requests = <i>⚠️ Вы отправляете слишком много запросов, пожалуйста, подождите немного</i>
ntf-user-block-self = <i>❌ Нельзя заблокировать самого себя</i>
ntf-user-switch-role-self = <i>❌ Нельзя сменить роль самому себе</i>
ntf-user-not-found = <i>❌ Пользователь не найден</i>

ntf-user-block-dev =
    ⚠️ Разработчик { $id } ({ $name }) попытался вас заблокировать!

    <i>Он был разжалован и заблокирован</i>

ntf-user-switch-role-dev =
    ⚠️ Разработчик { $id } ({ $name }) попытался сменить вам роль!

    <i>Он был разжалован и заблокирован</i>

ntf-maintenance-denied-global = <i>🚧 Бот в режиме обслуживания, попробуйте позже</i>
ntf-maintenance-denied-purchase= <i>🚧 Бот в режиме обслуживания, Вам придет уведомление когда бот снова будет доступен</i>


ntf-plan-wrong-name = <i>❌ Неверное имя</i>
ntf-plan-wrong-number= <i>❌ Неверное число</i>
ntf-plan-negative-number= <i>❌ Отрицательное число</i>